//Священко Станіслав Володимирочич, група N 123, Лабораторна робота 1.5
#include <iostream>
int main() {
	// Частина 1
	// 2. Опис змінних цілого та дійсного типу згідно з варіантом
	int A = 45, B = 13, C = 47, D = 59;
	// 3. Використання унарних, бінарних логічних операцій та операцій відношення при обчисленні першого виразу
	bool bRez1 = !(!(A != B) || (!(C > D)));
	//2. Опис змінних цілого та дійсного типу згідно з варіантом
	float A1 = 84.6f, B1 = 84.6;
	int C1 = 63, D1 = 34;
	// 3. Використання унарних, бінарних логічних операцій та операцій відношення при обчисленні першого виразу
	bool bRez2 = !(!(A1 != B1) || (!(C1 > D1)));
	//Виведення результатів
	std::cout << bRez1 << std::endl;
	std::cout << bRez2 << std::endl;

	// Частина 2
	// 1. Опис константи, використовуючи R-вираз.
	const short CONSTA = 71;
	//2. Опис та ініціювання змінної R-виразом.
	short B3 = 15, E = 49;
	short C3;
	short *pC;
	pC = &C3;
	*pC = 53.4;
	//4. Обчислення виразу таким чином, щоб операції виконувалися в наступній послідовності: унарні операції, бітові операції, арифметичні операції, операція відношення.
	bool bRez3 = ((CONSTA & ~B) + *pC) != (1 * (E >> sizeof(float)));
	//Виведення результату
	std::cout << bRez3 << std::endl;
}
