// Священко Станіслав 123 група Лабораторна робота 1.7
#include <iostream>
// завдання 1
int main() {
	{
		int a = 10;
	}
	{
		int b = 1;
		int c = 5;
	}
	{
		int d = 3;
	}

	// завдання 2
	static int s; // глобальна описана статична змінна
	static int x = 7; // глобальна описана ініціалізована статична змінна

	{
		int s = 30;
		{
			int w; // не статична змінна
			static int p =  28; // локальна статична описана ініціалізована змінна

			// змінна p не існує поза межами блока
			int s = p - x;
		}
		s += 5; // збільшення глобальної статичної змінної на 5
	}
	for (int i = 0; i < 7; i++) 
	{
		static int g = 0;
		g++;
	} // створення циклу в результаті якого статичні зміна g збільшується на 1
	// завдання 3
	float flA = 15; // динамічний розподіл пам'яті в стеку, flA описана та ініціалізована значенням 20
	int nB = 4;
	for (int i = 0; i < 5; i++)
	{
		static int nT = 0;
		nT++;
		int nH = 0;
		nH++;
		nB++;
	}

		


}
